//
//  Words.swift
//  The Guess
//
//  Created by Nick on 15.02.2021.
//


/// Contains Arrays of Game Words and Button Labels
struct Words {
    static let menuButtons =   [" ", "Начать игру", "Настройки", " "]
    static let themesButtons = [" ", "Столицы", "Автомобили", "Покемоны", " "]
    static let complexityButtons = [" ", "Легкий", "Средний", "Сложный", " "]
    
    static let capitals: [String] = ["Токио", "Москва", "Дели", "Сеул", "Джакарта", "Бангкок","Мехико",
                                     "Каир", "Лима", "Лондон", "Богота", "Сантьяго-де-Чили","Сингапур",
                                     "Кейптаун", "Берлин", "Афины", "Мадрид", "Найроби","Буэнос-Айрес",
                                     "Киев", "Рим", "Тайбэй", "Гавана", "Париж", "Алжир","Пномпень",
                                     "Бухарест", "Кито", "Куала-Лумпур", "Будапешт","Варшава", "Вена",
                                     "Манила", "София", "Бейрут", "Прага", "Тунис","Белград", "Дублин",
                                     "Стокгольм", "Амстердам", "Загреб", "Иерусалим","Рига", "Вашингтон",
                                     "Осло", "Хельсинки", "Вильнюс", "Копенгаген","Лиссабон", "Эдинбург",
                                     "Веллингтон", "Братислава", "Таллин", "Брюссель","Рейкьявик", "Люксембург",
                                     "Валлетта", "Пекин", "Монако"]
    
    
    static let auto: [String] =     ["Альфа Ромео", "Альпина", "Американ Моторс", "Астон Мартин",
                                     "БМВ", "Бьюик", "Бугатти", "Кадиллак", "Чекер", "Шевроле", "Крайслер",
                                     "Ситроен", "Континенталь", "Кросли", "Дача", "ДеСото", "Де Томасо", "Додж",
                                     "Игл", "Эдсел", "Экскалибур", "Фазель", "Феррари", "Фиат", "Форд", "Генри Д",
                                     "Индостан", "Холден", "Хонда", "Хадсон", "Империал", "Ягуар", "Джип", "Кайзер",
                                     "Лэнд Ровер", "Ламборгини", "Ланча", "Линкольн", "Лотус", "Макларен",
                                     "Мазератти", "Мазда", "Мерседес-Бенз", "Меркурий", "Массершмит", "Метрополитен",
                                     "Митсубиси", "Наш", "Ниссан", "Олдсмобиль", "Опель", "Пакард", "Пиль",
                                     "Пежо", "Плимут", "Понтиак", "Порше", "Рамблер", "Рено", "Ролс-Ройс",
                                     "Саб", "Сатурн", "Сеат", "Самса", "Смарт", "Студебеккер", "Субару", "Шкода",
                                     "Тойота", "Тесла", "Трабант", "Фольксваген",
                                     "Вольво", "ЗИЛ", "Лада"]
    
    static let pokemons: [String] = ["Абра", "Беллспраут", "Бульбазавр", "Вартортл", "Венонат", "Видл", "Випинбелл",
                                     "Волторб", "Вульпикс", "Гастли", "Глум", "Голдин", "Гравелер", "Граймер",
                                     "Гроулит", "Джеодуд", "Джигглипуф", "Диглетт", "Додуо", "Драгонэйр", "Дратини",
                                     "Дроузи", "Зубат", "Иви", "Ивизавр", "Игглибафф", "Кабуто", "Кадабра", "Какуна",
                                     "Катерпи", "Клефейри", "Клеффа", "Коффинг", "Крабби", "Кубон", "Магби", "Магнемайт",
                                     "Майм Младший", "Манки", "Манчлакс", "Мачоп", "Мачоук", "Метапод", "Мэджикарп",
                                     "Мяут", "Нидоран", "Нидоран", "Нидорина", "Нидорино", "Оддиш", "Оманайт", "Парас",
                                     "Пиджеотто", "Пиджи", "Пикачу", "Пичу", "Поливаг", "Поливирл", "Понита", "Псидак",
                                     "Райхорн", "Раттата", "Сил", "Сквиртл", "Слоупок", "Смучам", "Спироу", "Старью",
                                     "Сэндшру", "Тентакул", "Тирог", "Хонтер", "Хорси", "Хэппини", "Чармандер", "Чармелеон",
                                     "Шеллдер", "Эканс", "Экзеггут", "Элекид"]
}
